case/constant/food/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo; 
    mixture         pureMixture; 
    transport       constIso; 
    thermo          hConst; 
    equationOfState rhoConst; 
    specie          specie; 
    energy          sensibleEnthalpy;
}


mixture 
{ 
    specie 
    { 
        nMoles      1; 
        molWeight   18; 
    } 

    transport 
    { 
        kappa   0.173; 
    } 

    thermodynamics 
    { 
        Hf      0; 
        Cp      1884; 
    } 

    equationOfState 
    { 
        rho     1110; 
    } 
} 


// ************************************************************************* //
