case/0/cap/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/cap";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    wedge0
    {
        type            wedge;
        value           uniform 100000;
        physicalType    wedge;
    }
    wedge1
    {
        type            wedge;
        value           uniform 100000;
        physicalType    wedge;
    }
    cap_to_food
    {
        type            calculated;
        value           uniform 0;
    }
    cap_to_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
