case/0/steel/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/steel";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    wedge0
    {
        type            wedge;
        physicalType    wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    up
    {
        type            fixedGradient;
        gradient        uniform 4;
    }
    wedge1
    {
        type            wedge;
        physicalType    wedge;
    }
    ref
    {
        type            fixedValue;
        value           uniform 300;
    }
    steel_to_fluid
    {
        type            wall;
        value           uniform 200;
        Tnbr            T;
        kappaMethod     solidThermo;
        physicalType    wall;
    }
    steel_to_food
    {
        type            wall;
        value           uniform 200;
        Tnbr            T;
        kappaMethod     solidThermo;
        physicalType    wall;
    }
}


// ************************************************************************* //
