case/system/steel/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.2.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      fvSchemes; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

ddtSchemes 
{ 
    default         steadyState; 
} 

gradSchemes 
{ 
    default         Gauss linear; 
} 

divSchemes 
{ 
    default         none; 
} 

laplacianSchemes 
{ 
    default             none; 
    laplacian(alpha,h)  Gauss linear uncorrected; 
} 

interpolationSchemes 
{ 
    default         linear; 
} 

snGradSchemes 
{ 
    default         uncorrected; 
} 

fluxRequired 
{ 
    default         no; 
} 

// ************************************************************************* //