case/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.2.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      fvSolution; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

solvers 
{ 
    h 
    { 
        solver           PCG; 
        preconditioner   DIC; 
        tolerance        1e-06; 
        relTol           0.01; 
    } 
} 

PIMPLE
{
    nOuterCorrectors 1;
}

relaxationFactors 
{ 
    fields 
    { 
    } 
    equations 
    { 
        h               0.9; 
    } 
} 

// ************************************************************************* //