case/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volumetricHeatSource
{
    type            scalarSemiImplicitSource;
    active          true;
    selectionMode   cellZone;  //cellSet // points //all  (other options)
    cellZone        fluid;
    
    scalarSemiImplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRateSuSp
        {
            h (3 0);   // S(T)=S_u+S_p*T  ===>  S_u=g    S_p=0   
        }              // g= specific volumetric generation (W/m3) , rho=density, cp= specific heat (S.I.)  
    }                  // g= absolute volumetric generation (W) ===> in the example 3W are considered
}

// ************************************************************************* //
